Revit 2024 API
RevitLinkType.HasSaveablePositions Method
 Determines whether the link has changes to shared positioning that could be saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool HasSaveablePositions()
Visual Basic
Public Function HasSaveablePositions As Boolean
Visual C++
public:
bool HasSaveablePositions()
Return Value
 True if the link has shared positioning changes which can be saved. False if there are no changes to shared coordinates, or if the changes cannot be saved.
See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace